In [1]:
import numpy as np
import pandas as pd

In [11]:
vals = np.array([1,np.nan,3,4])

In [12]:
vals

array([ 1., nan,  3.,  4.])

In [20]:
data = np.random.random(15).reshape(5,3)

In [21]:
data

array([[0.04615646, 0.63867676, 0.67666832],
       [0.88583892, 0.19129979, 0.66088989],
       [0.65791665, 0.72271016, 0.34805574],
       [0.08171667, 0.0951846 , 0.51328804],
       [0.30150878, 0.39802942, 0.71225656]])

In [22]:
data1 = pd.DataFrame(data)

In [23]:
data1

          0         1         2
0  0.046156  0.638677  0.676668
1  0.885839  0.191300  0.660890
2  0.657917  0.722710  0.348056
3  0.081717  0.095185  0.513288
4  0.301509  0.398029  0.712257

In [27]:
data1.iloc[0][0]=np.nan

In [28]:
data1

          0         1         2
0       NaN  0.638677  0.676668
1  0.885839  0.191300  0.660890
2  0.657917  0.722710  0.348056
3  0.081717  0.095185  0.513288
4  0.301509  0.398029  0.712257

In [32]:
data1.fillna(0)

          0         1         2
0  0.000000  0.638677  0.676668
1  0.885839  0.191300  0.660890
2  0.657917  0.722710  0.348056
3  0.081717  0.095185  0.513288
4  0.301509  0.398029  0.712257

In [33]:
data2= data1.dropna()

In [40]:
data2.reset_index(drop=True, inplace=True)

In [41]:
data2

          0         1         2
0  0.885839  0.191300  0.660890
1  0.657917  0.722710  0.348056
2  0.081717  0.095185  0.513288
3  0.301509  0.398029  0.712257

In [42]:
data2.iloc[0][1]= np.nan

In [49]:
data2.dropna().reset_index(drop=True)

          0         1         2
0  0.657917  0.722710  0.348056
1  0.081717  0.095185  0.513288
2  0.301509  0.398029  0.712257